function [f,g]=mente(x)
    f = 0*x(1)+0.1*x(2)+0.2*x(3)+0.3*x(4)+0.8*x(5)+0.9*x(6)+1.1*x(7)+1.4*x(8);
    g = [x(1) + 2*x(2) + x(4) + x(6) - 100;
        2*x(3) + 2*x(4) + x(5)+x(6)+3*x(7) - 100;
        3*x(1) + x(2)+2*x(3)+3*x(5)+x(6)+4*x(8)-100];
end

% 初始化随机数生成器，确保每次运行结果相同
rand('state', sum(clock));

% 初始化最优目标函数值和最优解
p0 = Inf;
x0 = [];

% 计时开始
tic;

% 循环生成随机解
for i = 1:10^7
    % 生成随机解
    x = 99 * rand(8, 1);
    % 取整和向上取整
    x1 = floor(x);
    x2 = ceil(x);
    
    % 计算当前解的目标函数和约束条件
    [f, g] = mente(x1);
    % 检查是否满足所有约束条件
    if sum(g <= 0) == 3
        % 检查是否是当前最优解
        if p0 >= f
            x0 = x1;
            p0 = f;
        end
    end
    
    % 对向上取整的解也进行同样的检查
    [f, g] = mente(x2);
    if sum(g <= 0) == 3
        if p0 >= f
            x0 = x2;
            p0 = f;
        end
    end
end

% 计时结束
toc;

% 输出最优解和最优目标函数值
x0, p0